Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/european_government/eu_institutions/european_court_of_justice.html.txt.tmx
Source language: en
Languages: ga

source: European Court of Justice
ga: Cúirt Bhreithiúnais an Aontais Eorpaigh

source: The European Court of Justice (ECJ) is the judicial institution of the European Union
ga: Is éard atá i gCúirt Bhreithiúnais an Aontais Eorpaigh (CBE) ná institiúid bhreithiúnach de chuid an Aontais Eorpaigh

source: This means that it deals with disputes between parties as the courts do in Ireland
ga: Ciallaíonn sé seo go ndéileálann sé le díospóidí idir pháirtithe mar a dhéanann na cúirteanna in Éirinn

source: The ECJ has the important function of ensuring that European law is interpreted and applied in the same way in every member state
ga: Tá an fheidhm thábhachtach ag an CBE a chinntiú go ndéantar ateangaireacht ar agus go gcuirtear dlí Eorpach i bhfeidhm ar an mbealach céanna i ngach ballstát

source: It sits in Luxembourg and is composed of 28 judges, one judge from each member state
ga: Suíonn an chúirt i Luxembourg agus tá sé déanta suas ag 28 breitheamh, breitheamh amháin as gach ceann de na ballstáit

source: In addition to the 28 judges at the ECJ, there are 8 Advocate Generals who deliver reasoned opinions on cases to assist the ECJ in making its decisions
ga: Anuas ar an 28 breitheamh a shuíonn ag an ECJ, tá 8 Abhcóide Ginearálta a thugann tuairimí réasúnaithe ar chásanna chun cabhrú leis an CBE a cinntí a dhéanamh

source: Judges and Advocate Generals of the ECJ must have the qualifications to be appointed to the highest national courts in their member states or they may be jurisconsults (academic lawyers)
ga: Caithfidh na cáilíochtaí a bheith ag Breithimh agus ag Abhcóidí Ginearálta a bheith ceaptha ag na cúirteanna náisiúnta is airde ina mballstáit nó d’fhéadfaidís a bheith ina ndlí-eolaithe (dlíodóirí acadúla)

source: Their independence must be beyond doubt
ga: Caithfidh a neamhspleáchas a bheith thar amhras

source: This means that once they are appointed, they may not hold any other office of an administrative or political nature and they may not engage in any occupation, paid or unpaid
ga: Ciallaíonn sé seo nuair a cheaptar iad, ní féidir leo a bheith i seilbh aon oifig eile bunaithe ar riarachán ná ar pholaitíocht agus ní féidir leo aon ghairm a chleachtadh, bíodh sé íoctha nó gan íocaíocht

source: The Judges and Advocate Generals are appointed by joint agreement of the governments of the member states
ga: Tá na Breithimh agus na hAbhcóidí Ginearálta ceaptha trí chomhaontú rialtais na mballstát

source: They have a renewable term of 6 years
ga: Tá téarma de shé bliana in-athnuaite acu

source: The European Court of Justice sits and hears cases all year round
ga: Suíonn Cúirt Bhreithiúnais an Aontais Eorpaigh agus éisteann sí le cásanna i rith na bliana ar fad

source: The Court of First Instance was set up in 1989
ga: Bunaíodh An Chúirt Chéadchéime sa bhliain 1989

source: The Court of First Instance rules on certain categories of cases at first instance, for example, cases relating to breach of competition law, breach of commercial policy or social policy or disputes concerning EU staff regulations
ga: Rialaíonn An Chúirt Chéadchéime ar chatagóirí de chásanna ar leith ag an gcéad chéim, mar shampla, cásanna maidir le sárú dlí na hiomaíochta, sárú pholasaí tráchtála nó pholasaí sóisialta nó díospóidí maidir le rialacháin foirne an AE

source: Decisions of the Court of First Instance may be appealed to the ECJ
ga: Is féidir cinntí den Chúirte Chéadchéime a achomharc chuig an ECJ

source: The ECJ upholds the Treaties and ensures that European law is interpreted and applied in the same way across the EU through various forms of legal action
ga: Cumhdaíonn an CBE na Conarthaí agus cinntíonn sí go ndéantar ateangaireacht ar agus go gcuirtear dlí na hEorpa i bhfeidhm ar an mbealach céanna ar fud an AE trí mhúnlaí éagsúla de chaingne dlí

source: To avoid differences of interpretation of EU law by national courts, the preliminary ruling procedure allows co-operation between national courts and the ECJ
ga: Chun difríochtaí ateangaireachta de dlí an AE ag cúirteanna náisiúnta a sheachtaint, ceadaíonn an gnáthamh réamhrialaithe comhoibriú idir chúirteanna náisiúnta agus an CBE

source: If a case comes before a national court that involves an interpretation of an EU law and there is a doubt as to how it should be interpreted, the national court will refer the question to the ECJ to decide
ga: Má thagann cás os comhair chúirt náisiúnta a bhaineann le hateangaireacht dlí an AE agus mura bhfuil amhras ar bith faoin gcaoi ar chóir ateangaireacht a dhéanamh air, atreoróidh an chúirt náisiúnta an cheist chuig an CBE chun cinneadh a dhéanamh uirthi

source: The ECJ will make a decision as to how the law should be interpreted or applied and will send that decision to the national court
ga: Déanfaidh an CBE cinneadh ar an gcaoi ar chóir ateangaireacht a dhéanamh ar an dlí nó cén chaoi é a chur i bhfeidhm agus seolfaidh sé an cinneadh sin chuig an gcúirt náisiúnta

source: The national court must then apply that decision to the case before it
ga: Ní mór don chúirt náisiúnta an cinneadh a chur i bhfeidhm ar an gcás roimhe

source: • Proceedings for failure to fulfill an obligation
ga: • Imeachtaí maidir le feall oibleagáid a chomhlíonadh

source: The Commission or a member state may commence proceedings at the ECJ to force a member state to comply with EU law
ga: D’fhéadfadh an Coimisiún nó ballstát tús a chur le himeachtaí ag an CBE d’fhonn iallach a chur ar bhallstát géilleadh le dlí an AE

source: If the ECJ decides that the member state in question is at fault, the member state must rectify the situation without delay
ga: Má chinneann an ECJ go bhfuil an ballstát i gceist fabhtach, ní mór don bhallstát an dáil a cheartú gan mhoill

source: A member state, the Commission, the Council of the European Union or the European Parliament may request the annulment or cancellation of an EU law
ga: D’fhéadfadh ballstát, An Coimisiún, Comhairle an Aonais Eorpaigh nó Parlaimint na hEorpa iarraidh ar neamhniú nó ar chealú dlí an AE

source: This may happen if an EU institution enacts a law that conflicts with the EU Treaties
ga: D’fhéadfadh sé seo tarlú má achtaíonn institiúid de chuid an AE dlí i gcoinbhleacht le Conarthaí an AE

source: If the ECJ agrees that the disputed law is contrary to the Treaties, it will declare the law null and void
ga: Má aontaíonn an CBE go bhfuil an dlí díospóidte i gcontráilte na gConarthaí, fógróidh sé an dlí ar neamhní go hiomlán

source: Private individuals may also bring proceedings for annulment of an EU law if they can demonstrate that the disputed law affects them directly and individually
ga: Is féidir le daoine príobháideacha imeachtaí le haghaidh neamhnithe dlí an AE a thógáil más féidir leo a léiriú go bhfuil tionchar ag an dlí díospóidte orthu go díreach agus go haonánach

source: To bring proceedings for annulment, you should obtain legal advice and/or representation
ga: Chun imeachtaí le haghaidh neamhnithe a thógáil, ba cheart duit comhairle dlí agus/nó ionadaíocht a fháil

source: You do not need to go through the national courts first in order to bring proceedings for annulment in the ECJ
ga: Ní gá duit dul tríd na cúirteanna náisiúnta ar dtús chun imeachtaí le haghaidh neamhnithe a thógáil san ECJ

source: If you lose the case at the ECJ, you may be liable to pay the costs of both sides
ga: Má chailleann tú an cás ag an CBE, seans go mbeidh ort costais an dá thaobh a íoc

source: If you succeed, your costs will be paid by the EU and the law will be declared null and void throughout the EU
ga: Má éiríonn leat, íocfaidh an AE as do chostais agus fógrófar an dlí neamhní go hiomlán ar fud an AE
